# ref: https://github.com/ultralytics/ultralytics/blob/main/ultralytics/cfg/models/v8/yolov8.yaml
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 8  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1, 3, C2f, [128, True]]  # 2
#   - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
#   - [-1, 6, C2f, [256, True]]  # 4
#   - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
#   - [-1, 6, C2f, [512, True]]  # 6
#   - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
#   - [-1, 3, C2f, [1024, True]]  # 8
#   - [-1, 1, SPPF, [1024, 5]]  # 9

# # YOLOv8.0n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
#   - [[-1, 6], 1, Concat, [1]]  # 11-cat backbone P4
#   - [-1, 3, C2f, [512]]  # 12

#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
#   - [[-1, 4], 1, Concat, [1]]  # 14-cat backbone P3
#   - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]  # 16
#   - [[-1, 12], 1, Concat, [1]]  # 17-cat head P4
#   - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]  # 19
#   - [[-1, 9], 1, Concat, [1]]  # 20-cat head P5
#   - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)

#   - [[15, 18, 21], 1, Detect, [nc]]  # 22-Detect(P3, P4, P5)

# YOLOv8.0n backbone with ViT Encoders
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, ViTEncoder, [256, 2, 2, 4.0, 0.1]]  # 5-ViT after C2f2
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 6, C2f, [512, True]]  # 7
  - [-1, 1, ViTEncoder, [512, 4, 2, 4.0, 0.1]]  # 8-ViT after C2f3
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, C2f, [1024, True]]  # 10
  - [-1, 1, ViTEncoder, [1024, 8, 2, 4.0, 0.1]]  # 11-ViT after C2f4
  - [-1, 1, SPPF, [1024, 5]]  # 12

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 8], 1, Concat, [1]]  # 14-cat backbone P4
  - [-1, 3, C2f, [512]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 5], 1, Concat, [1]]  # 17-cat backbone P3
  - [-1, 3, C2f, [256]]  # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20-cat head P4
  - [-1, 3, C2f, [512]]  # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23-cat head P5
  - [-1, 3, C2f, [1024]]  # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]  # 25-Detect(P3, P4, P5)

  # Pretrained weights
pretrained: True
model_path: /data/cmpe258-sp24/017553289/cmpe249/ObjectDetection2D/yolov8n.pt